In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.read_csv("C:\\Users\\saurabh\\Desktop\\Newdat\\placement.csv")

In [ ]:
df

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [ ]:
df.head()   # top 5 data

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1

In [ ]:
df.tail() # bottom 5 data

    cgpa  resume_score  placed
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

In [ ]:
df.describe()  # statically view of data

           cgpa  resume_score      placed
count  100.0000    100.000000  100.000000
mean     6.9422      6.930500    0.500000
std      1.1192      0.979608    0.502519
min      5.2700      4.950000    0.000000
25%      5.9800      6.190000    0.000000
50%      6.6200      7.055000    0.500000
75%      8.0450      7.640000    1.000000
max      9.4000      9.060000    1.000000

In [ ]:
df.info() # Data type information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cgpa          100 non-null    float64
 1   resume_score  100 non-null    float64
 2   placed        100 non-null    int64
dtypes: float64(2), int64(1)
memory usage: 2.5 KB

In [ ]:
top_left_corner_df = df.iloc[:4 , :3]  # iloc[row_range , column_range]
top_left_corner_df

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1

In [ ]:
df.loc[1:3 , ['cgpa' , 'placed']]   ### loc[row_range , column_names]

   cgpa  placed
1  6.17       0
2  8.27       1
3  6.88       1

In [ ]:
s =   df.axes
s

[RangeIndex(start=0, stop=100, step=1),
 Index(['cgpa', 'resume_score', 'placed'], dtype='object')]

In [ ]:
p = df.dtypes
p

cgpa            float64
resume_score    float64
placed            int64
dtype: object

In [ ]:
b = df.empty  ### it returns true if there any missing data in dataframe otherwise returns false.
b

False

In [ ]:
df.isnull().sum() ### for check missing values .

In [ ]:
df.dropna() ### for remove missing row .

In [ ]:
i = df.ndim   #number of axes (it is 2)
i

2

In [ ]:
t = df.shape  # shape = n(rows) , n(columns)
t

(100, 3)

In [ ]:
d = df.size          # row count * column count
d

300

In [ ]:
a = df.values    # get a numpy array for df
a

array([[8.14, 6.52, 1.  ],
       [6.17, 5.17, 0.  ],
       [8.27, 8.86, 1.  ],
       [6.88, 7.27, 1.  ],
       [7.52, 7.3 , 1.  ],
       [8.77, 6.19, 1.  ],
       [5.34, 7.09, 0.  ],
       [6.56, 6.29, 0.  ],
       [6.32, 6.71, 0.  ],
       [7.69, 7.12, 1.  ],
       [6.18, 6.35, 0.  ],
       [5.44, 6.54, 0.  ],
       [6.09, 7.01, 0.  ],
       [8.5 , 5.09, 1.  ],
       [7.51, 6.25, 1.  ],
       [8.88, 5.93, 1.  ],
       [8.04, 7.64, 1.  ],
       [7.81, 8.71, 1.  ],
       [5.94, 5.88, 0.  ],
       [6.75, 8.11, 1.  ],
       [5.8 , 8.06, 0.  ],
       [6.53, 7.64, 0.  ],
       [6.16, 5.77, 0.  ],
       [6.05, 7.13, 0.  ],
       [8.22, 6.18, 1.  ],
       [7.76, 5.68, 1.  ],
       [6.27, 6.47, 0.  ],
       [5.51, 6.15, 0.  ],
       [7.46, 7.67, 1.  ],
       [6.19, 7.3 , 0.  ],
       [7.36, 7.15, 1.  ],
       [5.92, 7.02, 0.  ],
       [5.87, 7.96, 0.  ],
       [8.43, 7.73, 1.  ],
       [8.87, 7.19, 1.  ],
       [8.07, 7.48, 1.  ],
       [8.16, 7.56, 1.  ],
       [9.05, 8.21, 1.  ],
       [6.  , 8.72, 0.  ],
       [7.5 , 6.19, 1.  ],
       [8.25, 5.32, 1.  ],
       [8.68, 5.15, 1.  ],
       [6.9 , 6.91, 1.  ],
       [8.21, 7.95, 1.  ],
       [5.47, 5.92, 0.  ],
       [8.1 , 5.44, 1.  ],
       [5.83, 5.21, 0.  ],
       [7.05, 8.14, 1.  ],
       [5.54, 6.57, 0.  ],
       [5.46, 6.73, 0.  ],
       [8.22, 6.74, 1.  ],
       [6.54, 7.39, 0.  ],
       [5.9 , 7.5 , 0.  ],
       [6.  , 7.16, 0.  ],
       [5.92, 7.18, 0.  ],
       [6.94, 6.87, 1.  ],
       [6.13, 6.43, 0.  ],
       [6.34, 7.21, 0.  ],
       [6.47, 7.37, 0.  ],
       [5.95, 7.57, 0.  ],
       [5.87, 6.64, 0.  ],
       [6.89, 7.96, 1.  ],
       [5.75, 8.43, 0.  ],
       [8.65, 7.58, 1.  ],
       [7.93, 8.09, 1.  ],
       [6.04, 8.75, 0.  ],
       [8.35, 8.02, 1.  ],
       [6.59, 6.81, 1.  ],
       [6.01, 7.49, 0.  ],
       [8.06, 9.06, 1.  ],
       [7.12, 7.41, 1.  ],
       [7.34, 8.22, 1.  ],
       [7.63, 7.98, 1.  ],
       [5.76, 6.48, 0.  ],
       [5.54, 7.36, 0.  ],
       [6.34, 7.94, 1.  ],
       [9.4 , 5.5 , 1.  ],
       [5.88, 6.92, 0.  ],
       [5.79, 5.66, 0.  ],
       [5.27, 7.28, 0.  ],
       [7.83, 7.7 , 1.  ],
       [6.12, 6.72, 0.  ],
       [7.92, 6.06, 1.  ],
       [7.6 , 8.08, 1.  ],
       [5.76, 6.49, 0.  ],
       [6.72, 5.46, 0.  ],
       [6.18, 5.76, 0.  ],
       [5.62, 5.05, 0.  ],
       [8.07, 6.07, 1.  ],
       [5.99, 7.49, 0.  ],
       [5.85, 5.56, 0.  ],
       [8.28, 6.3 , 1.  ],
       [5.43, 6.18, 0.  ],
       [9.31, 7.39, 1.  ],
       [8.01, 4.95, 1.  ],
       [6.33, 6.38, 0.  ],
       [8.23, 7.76, 1.  ],
       [6.65, 7.78, 0.  ],
       [8.14, 5.63, 1.  ],
       [6.09, 6.61, 0.  ]])

In [ ]:
df = df.copy()

In [ ]:
p = df.sort_values(by = 'resume_score')
p

    cgpa  resume_score  placed
94  8.01          4.95       1
87  5.62          5.05       0
13  8.50          5.09       1
41  8.68          5.15       1
1   6.17          5.17       0
..   ...           ...     ...
17  7.81          8.71       1
38  6.00          8.72       0
65  6.04          8.75       0
2   8.27          8.86       1
69  8.06          9.06       1

[100 rows x 3 columns]

In [ ]:
r = df.sort_index()
r

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [ ]:
# x = df.astype(int)   # type conversion
df['cgpa'] = df['cgpa'].astype(int)
# df

    cgpa  resume_score  placed
0     80            36      75
1     37             5      25
2     88            99      75
3     54            59      75
4     65            61      75
..   ...           ...     ...
95    43            31      25
96    86            80      75
97    51            81      25
98    80            12      75
99    32            39      25

[100 rows x 3 columns]

In [ ]:
df['Salary'].astype(float)

In [ ]:
s = df.abs()
s

    cgpa  resume_score  placed
0   80.5          36.0    75.5
1   37.0           5.0    25.5
2   88.0          99.0    75.5
3   54.0          59.0    75.5
4   65.0          61.5    75.5
..   ...           ...     ...
95  43.0          31.0    25.5
96  86.0          80.0    75.5
97  51.0          81.0    25.5
98  80.5          12.0    75.5
99  32.5          39.0    25.5

[100 rows x 3 columns]

In [ ]:
# t = df.add(4)
t
df['cgpa'] = df['cgpa'].add(4)

    cgpa  resume_score  placed
0   84.5          40.0    79.5
1   41.0           9.0    29.5
2   92.0         103.0    79.5
3   58.0          63.0    79.5
4   69.0          65.5    79.5
..   ...           ...     ...
95  47.0          35.0    29.5
96  90.0          84.0    79.5
97  55.0          85.0    29.5
98  84.5          16.0    79.5
99  36.5          43.0    29.5

[100 rows x 3 columns]

In [ ]:
df['cgpa'].add(10)

In [ ]:
s = df.count()
s

cgpa            100
resume_score    100
placed          100
dtype: int64

In [ ]:
p = df.max()
p

cgpa            100.0
resume_score    100.0
placed           75.5
dtype: float64

In [ ]:
q = df.min()
q

cgpa             1.0
resume_score     1.0
placed          25.5
dtype: float64

In [ ]:
r = df['cgpa'].mean()
r

cgpa            50.5
resume_score    50.5
placed          50.5
dtype: float64

In [ ]:
s = df['cgpa'].median()
s

cgpa            50.5
resume_score    50.5
placed          50.5
dtype: float64

In [ ]:
s = df.sum()
s

cgpa            5050.0
resume_score    5050.0
placed          5050.0
dtype: float64

In [ ]:
g = df.filter(items = ['cgpa' , 'placed'])
g

df[['cgpa' , 'placed']]   #### second option of filtering

    cgpa  placed
0   80.5    75.5
1   37.0    25.5
2   88.0    75.5
3   54.0    75.5
4   65.0    75.5
..   ...     ...
95  43.0    25.5
96  86.0    75.5
97  51.0    25.5
98  80.5    75.5
99  32.5    25.5

[100 rows x 2 columns]

In [ ]:
s = df.filter(items = [5,6] , axis = 0) ### axis = 0 means row wise operation
s

   cgpa  resume_score  placed
5  95.0          25.5    75.5
6   2.0          51.0    25.5

In [ ]:
t = df.filter(like = '5' , axis = 0)
t

    cgpa  resume_score  placed
5   95.0          25.5    75.5
15  97.0          19.0    75.5
25  69.0          14.0    75.5
35  77.5          68.0    75.5
45  79.0           8.0    75.5
50  84.5          44.0    75.5
51  48.0          65.5    25.5
52  21.0          71.0    25.5
53  27.5          55.0    25.5
54  22.5          56.0    25.5
55  57.0          46.0    75.5
56  35.0          32.0    25.5
57  44.5          58.0    25.5
58  46.0          64.0    25.5
59  25.0          73.0    25.5
65  30.0          98.0    25.5
75  44.5          82.0    75.5
85  52.0           9.0    25.5
95  43.0          31.0    25.5

In [ ]:
s = df.to_dict()    # save in dictionary
# s

In [ ]:
q = df.to_string()    # save in string
# q

In [ ]:
e = df.to_csv("path_location")

In [ ]:
idx = df.columns
idx

Index(['cgpa', 'resume_score', 'placed'], dtype='object')

In [ ]:
label = df.columns[0]  # first column label
label

'cgpa'

In [ ]:
p = df.columns.tolist()    # list of column labels
p

['cgpa', 'resume_score', 'placed']

In [ ]:
q = df.columns.values    # array of column labels
q

array(['cgpa', 'resume_score', 'placed'], dtype=object)

In [ ]:
p = df.rename(columns = {'cgpa':'updated_cgpa' ,
                         'resume_score':'semester_marks'})  # How to rename a column
p

    half_yearly_marks  semester_marks  placed
0                80.5            36.0    75.5
1                37.0             5.0    25.5
2                88.0            99.0    75.5
3                54.0            59.0    75.5
4                65.0            61.5    75.5
..                ...             ...     ...
95               43.0            31.0    25.5
96               86.0            80.0    75.5
97               51.0            81.0    25.5
98               80.5            12.0    75.5
99               32.5            39.0    25.5

[100 rows x 3 columns]

In [ ]:
s =p.columns = ['cgpa' , 'resume_score' , 'placed']
s

['cgpa', 'resume_score', 'placed']

In [ ]:
df['half'] = df['cgpa'].where(df['cgpa']>7 , other = 0)
df.head(10)

   cgpa  resume_score  placed  half
0  80.5          36.0    75.5  80.5
1  37.0           5.0    25.5   0.0
2  88.0          99.0    75.5  88.0
3  54.0          59.0    75.5  54.0
4  65.0          61.5    75.5  65.0
5  95.0          25.5    75.5  95.0
6   2.0          51.0    25.5   0.0
7  49.0          28.0    25.5   0.0
8  42.0          41.0    25.5   0.0
9  68.0          52.0    75.5  68.0

In [ ]:
st = df['cgpa'].astype(int)   # Data type conversion
# st

# Task

# Create an Employee DataFrame in which you have (Emp_ID , Emp_Name , Department, Salary) Column and you have total 8 rows in your dataframe and you have too calculate :
    
    (1). Top 3 data
    (2). Bottom 4 data
    (3). Create a new column in which whose salary is greater than 20000  only shows rest all are 0.
    (4). Check Statically view and info() of dataframe ?